# -*- coding: utf-8 -*-
"""Копия блокнота "Практика 0.2.0 .ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1iRll9KOA5mqXS_9Bvs_YbVG9SRjAmd8w

Напишите свое ФИО: Хихлушка Екатерина
"""

print('Привет студентам!')

"""# Основы

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print("Привет,мир!")

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

username=input("Введите имя пользователя: ")
print("Привет, "+username)

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

number=int(input("Введите число: "))
if number%2==0:
  print("Ваше число четное!")
else:
  print("Ваше число нечетное!")

"""Задание 4: Напишите программу которая запрашивает длинну и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

a=int(input("Введите длину прямоугольника: "))
b=int(input("Введите ширину прямоугольника: "))
print("Площадь прямоугольника: ", (a+b)*2)

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

n=int(input("Введите количество чисел, которые Вы хотите ввести: "))
sum=0
for i in range(n):
  number=int(input("Введите число: "))
  sum+=number
print("Среднее арифметическое всех чисел: ", sum/n)

"""Задание 6: Напишите программу, которая бы определяла является ли год високосным
Пример:

`Введите год:` 2024

`Ваш год високосный!`
"""

year=int(input("Введите год: "))
if year%4==0:
  print("Ваш год високосный!")
else:
  print("Ваш год невисокосный!")

"""Задание 7: Необходимо создать простой калькулятор, который позволяет пользователю выбрать одну из четырёх операций (+, -, *, /), ввести два числа и получить результат выполнения операции.

`Введите операцию:`

`Введите первое число:`

`Введите второе число:`

`Результат выполнения: `

"""

operation=input("Введите операцию: ")
a=int(input("Введите первое число: "))
b=int(input("Введите второе число: "))
if operation=="+":
  print("Результат выполнения: ",(a+b))
elif operation=="-":
  print("Результат выполнения: ",(a-b))
elif operation=="*":
  print("Результат выполнения: ",(a*b))
else:
  print("Результат выполнения: ",(a/b))

"""# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""

import math
figure=input("Введите название фигуры: ")  ##размеры шахматной доски = 8 на 8 клеток
x0=int(input("Введите начальную координату х: "))
y0=int(input("Введите начальную координату y: "))
x=int(input("Введите конечную координату х: "))
y=int(input("Введите конечную координату y: "))
if figure=="пешка":
  if y-y0==1 or y-y0==-1:
    print(True)
  else:
    print(False)

elif figure=="конь":
  if (y-y0==2 and x-x0==1) or (y-y0==2 and x-x0==-1) or (y-y0==-2 and x-x0==-1) or (x-x0==2 and y-y0==1) or (x-x0==2 and y-y0==-1) or (x-x0==-2 and y-y0==1) or (x-x0==-2 and y-y0==-1):
    print(True)
  else:
    print(False)

elif figure=="слон":
  if  abs(x-x0)==abs(y-y0):
    print(True)
  else:
    print(False)
elif figure=="ладья":
  if y0==y or x==x0:
    print(True)
  else:
    print(False)

elif figure=="король":
  if y-y0==1 or y-y0==-1 or x-x0==1 or x-x0==-1 or (y-y0)**2+(x-x0)**2==math.sqrt(2):
    print(True)
  else:
    print(False)

elif figure=="ферзь":
  if y0==y or x0==x or math.abs(x-x0)==math.abs(y-y0):
    print(True)
  else:
    print(False)

"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""

N = int(input("Введите позицию N: "))
number = 1
position = 1
while position < N:
    number += 1
    position += len(str(number))
numeral = str(number)[N - position - 1]
print("Цифра на позиции= ", numeral)

"""# Практика 0.2.3


Возьмите код из задания 7 и улучшите ваш калькулятор следующим образом:

Пользователь вводит строку вида:

(5+5)*5 - данная строка содержит в себе математическое выражение, а также скобки

Ваша программа должная понять что за математическое выражение записано, проверить верно ли оно записано (пример неверного заполнения: (5(+)5)*5, а также расчитать его в соотвествии с правилами математики
"""

math_operation=input("Введите математическое выражение: ")
count_of_brackets = 0
for char in math_operation:
    if char == '(':
        count_of_brackets += 1
    elif char == ')':
        count_of_brackets -= 1
        if count_of_brackets < 0:
            print("Несоответствие скобок")
if count_of_brackets != 0:
    print("Несоответствие скобок")

operator = ['+', '-', '*', '/']
for char in math_operation:
    if char in operator:
        if char == '+' or char == '-':
            if math_operation.count(char) > 1:
                print("Некорректно введены операции")
                exit()
        if char == '*' or char == '/':
            if math_operation.count(char) > 1:
                print("Некорректно введены операции")
in_brackets = False
for i in range(len(math_operation)):
    char = math_operation[i]
    if char == '(':
        in_brackets = True
    elif char == ')':
        in_brackets = False
    elif char in operator and in_brackets:
        print(" Оператор внутри скобок")

res=eval(math_operation)
print(res)